var BibleAbbreviation = function () {
  var BibleAbbreviationJSON = BibleAbbreviationJSON = {
        "1": ["Быт.", "Бытие"],
        "2": ["Исх.", "Исход"],
        "3": ["Лев.", "Левит"],
        "4": ["Чис.", "Числа"],
        "5": ["Втор.", "Второзаконие"],
        "6": ["Нав.", "Иисус Навин"],
        "7": ["Суд.", "Судей"],
        "8": ["Руф.", "Руфь"],
        "9": ["1Цар.", "1 Царств"],
        "10": ["2Цар.", "2 Царств"],
        "11": ["3Цар.", "3 Царств"],
        "12": ["4Цар.", "4 Царств"],
        "13": ["1Пар.", "1 Паралипоменон"],
        "14": ["2Пар.", "2 Паралипоменон"],
        "15": ["Езд.", "Ездра"],
        "16": ["Неем.", "Неемия"],
        "17": ["Есф.", "Есфирь"],
        "18": ["Иов.", "Иов"],
        "19": ["Пс.", "Псалмы"],
        "20": ["Прит.", "Притчи"],
        "21": ["Еккл.", "Екклесиаст"],
        "22": ["Песн.", "Песни"],
        "23": ["Ис.", "Исаия"],
        "24": ["Иер.", "Иеремия"],
        "25": ["Плач.", "Плач"],
        "26": ["Иез.", "Иезекииль"],
        "27": ["Дан.", "Даниил"],
        "28": ["Ос.", "Осия"],
        "29": ["Иоил.", "Иоиль"],
        "30": ["Ам.", "Амос"],
        "31": ["Авд.", "Авдий"],
        "32": ["Ион.", "Иона"],
        "33": ["Мих.", "Михей"],
        "34": ["Наум.", "Наум"],
        "35": ["Авв.", "Аввакум"],
        "36": ["Соф.", "Софония"],
        "37": ["Агг.", "Аггей"],
        "38": ["Зах.", "Захария"],
        "39": ["Мал.", "Малахия"],
        "40": ["Мф.", "Матфея"],
        "41": ["Мк.", "Марка"],
        "42": ["Лк.", "Луки"],
        "43": ["Ин.", "Иоанна"],
        "44": ["Деян.", "Деяния"],
        "45": ["Рим.", "Римлянам"],
        "46": ["1Кор.", "1 Коринфянам"],
        "47": ["2Кор.", "2 Коринфянам"],
        "48": ["Гал.", "Галатам"],
        "49": ["Еф.", "Ефесянам"],
        "50": ["Флп.", "Филиппийцам"],
        "51": ["Кол.", "Колоссянам"],
        "52": ["1Фес.", "1 Фессалоникийцам"],
        "53": ["2Фес.", "2 Фессалоникийцам"],
        "54": ["1Тим.", "1 Тимофея"],
        "55": ["2Тим.", "2 Тимофея"],
        "56": ["Тит.", "Титу"],
        "57": ["Флм.", "Филимону"],
        "58": ["Евр.", "Евреям"],
        "59": ["Иак.", "Иакова"],
        "60": ["1Пет.", "1 Петра"],
        "61": ["2Пет.", "2 Петра"],
        "62": ["1Ин.", "1 Иоанна"],
        "63": ["2Ин.", "2 Иоанна"],
        "64": ["3Ин.", "3 Иоанна"],
        "65": ["Иуд.", "Иуды"],
        "66": ["Отк.", "Откровение"]
  };
  var BibleAbbreviationMap = new Map;

  for(var bookID in BibleAbbreviationJSON) {
    BibleAbbreviationMap.set(bookID, BibleAbbreviationJSON[bookID])
  }
  
  return BibleAbbreviationMap;
};

module.exports = BibleAbbreviation();


