var BibleAbbreviation = function () {
  var BibleAbbreviationJSON = BibleAbbreviationJSON = {
        "1": ["Быт.", "Бытие", "Буття"],
        "2": ["Исх.", "Исход", "Вихід"],
        "3": ["Лев.", "Левит", "Левит"],
        "4": ["Чис.", "Числа", "Числа"],
        "5": ["Втор.", "Второзаконие", "Повторення Закону"],
        "6": ["Нав.", "Иисус Навин", "Ісус Навин"],
        "7": ["Суд.", "Судей", "Суддів"],
        "8": ["Руф.", "Руфь", "Рут"],
        "9": ["1Цар.", "1 Царств", "1 Самуїла"],
        "10": ["2Цар.", "2 Царств", "2 Самуїла"],
        "11": ["3Цар.", "3 Царств", "1 Царів"],
        "12": ["4Цар.", "4 Царств", "2 Царів"],
        "13": ["1Пар.", "1 Паралипоменон", "1 Хроніки"],
        "14": ["2Пар.", "2 Паралипоменон", "2 Хроніки"],
        "15": ["Езд.", "Ездра", "Езра"],
        "16": ["Неем.", "Неемия", "Неемія"],
        "17": ["Есф.", "Есфирь", "Естер"],
        "18": ["Иов.", "Иов", "Йов"],
        "19": ["Пс.", "Псалмы", "Псалми"],
        "20": ["Прит.", "Притчи", "Приповісті"],
        "21": ["Еккл.", "Екклесиаст", "Екклезіяст"],
        "22": ["Песн.", "Песни", "Пісня над піснями"],
        "23": ["Ис.", "Исаия", "Ісая"],
        "24": ["Иер.", "Иеремия", "Єремия"],
        "25": ["Плач.", "Плач", "Плач Єремии"],
        "26": ["Иез.", "Иезекииль", "Єзекіїль"],
        "27": ["Дан.", "Даниил", "Даниїл"],
        "28": ["Ос.", "Осия", "Осія"],
        "29": ["Иоил.", "Иоиль", "Йоїл"],
        "30": ["Ам.", "Амос", "Амос"],
        "31": ["Авд.", "Авдий", "Овдій"],
        "32": ["Ион.", "Иона", "Йона"],
        "33": ["Мих.", "Михей", "Михей"],
        "34": ["Наум.", "Наум", "Наум"],
        "35": ["Авв.", "Аввакум", "Авакум"],
        "36": ["Соф.", "Софония", "Софонія"],
        "37": ["Агг.", "Аггей", "Агей"],
        "38": ["Зах.", "Захария", "Захарія"],
        "39": ["Мал.", "Малахия", "Малахій"],
        "40": ["Мф.", "Матфея", "Матвія"],
        "41": ["Мк.", "Марка", "Марка"],
        "42": ["Лк.", "Луки", "Луки"],
        "43": ["Ин.", "Иоанна", "Іван"],
        "44": ["Деян.", "Деяния", "Дії"],
        "45": ["Рим.", "Римлянам", "Римлян"],
        "46": ["1Кор.", "1 Коринфянам", "1 Коринтян"],
        "47": ["2Кор.", "2 Коринфянам", "2 Коринтян"],
        "48": ["Гал.", "Галатам", "Галатів"],
        "49": ["Еф.", "Ефесянам", "Єфесян"],
        "50": ["Флп.", "Филиппийцам", "Филип`ян"],
        "51": ["Кол.", "Колоссянам", "Колоссян"],
        "52": ["1Фес.", "1 Фессалоникийцам", "1 Солунян"],
        "53": ["2Фес.", "2 Фессалоникийцам", "2 Солунян"],
        "54": ["1Тим.", "1 Тимофея", "1 Тимофію"],
        "55": ["2Тим.", "2 Тимофея", "2 Тимофію"],
        "56": ["Тит.", "Титу", "Тита"],
        "57": ["Флм.", "Филимону", "Филимона"],
        "58": ["Евр.", "Евреям", "Євреїв"],
        "59": ["Иак.", "Иакова", "Якова"],
        "60": ["1Пет.", "1 Петра", "1 Петра"],
        "61": ["2Пет.", "2 Петра", "2 Петра"],
        "62": ["1Ин.", "1 Иоанна", "1 Івана"],
        "63": ["2Ин.", "2 Иоанна", "2 Івана"],
        "64": ["3Ин.", "3 Иоанна", "3 Івана"],
        "65": ["Иуд.", "Иуды", "Юда"],
        "66": ["Отк.", "Откровение", "Об`явлення"]
  };
  var BibleAbbreviationMap = new Map;

  for(var bookID in BibleAbbreviationJSON) {
    BibleAbbreviationMap.set(bookID, BibleAbbreviationJSON[bookID])
  }
  
  return BibleAbbreviationMap;
};

module.exports = BibleAbbreviation();


